# Вставка числа
# Требуется вставить в данный массив на данное место данный элемент, сдвинув остальные элементы вправо.
#
# Входные данные
#
# В первой строке вводится одно натуральное число, не превосходящее 1000 – размер массива. Во второй строке задаются N чисел – элементы массива (целые числа, не превосходящие по модулю 1000). В третьей строке вводится число, которое необходимо вставить, и номер места, на которое его нужно вставить.
#
# Выходные данные
#
# Вывести получившийся массив.
#
# Sample Input:
#
# 5
# 1 2 3 4 5
# 2 3
# Sample Output:
#
# 1 2 2 3 4 5

n = int(input())
arr = list(map(int, input().split(" ")))
k, index = map(int, input().split(" "))

el_end = arr[len(arr) - 1]


for i in range(len(arr) - 2, index - 2, -1):
    arr[i + 1] = arr[i]

arr[index-1] = k
arr.append(el_end)

print(*arr)