# Переставить элементы в обратном порядке
# Напишите программу, которая переставляет элементы массива в обратном порядке без использования дополнительного массива. Программа должна считать массив, поменять порядок его элементов, затем вывести результат (просто вывести элементы массива в обратном порядке – недостаточно!)
#
# Входные данные
#
# Сначала задано число N — количество элементов в массиве (1 ≤ N ≤ 35). Далее через пробел записаны N чисел — элементы массива. Массив состоит из целых чисел.
#
# Выходные данные
#
# Необходимо вывести массив, полученный после перестановки элементов. Числа следует выводить через пробел.
#
# Sample Input:
#
# 6
# 4 5 3 4 2 3
# Sample Output:
#
# 3 2 4 3 5 4

import math;

n = int(input());
arr = input().split(" ");
for i in range(math.ceil(len(arr)/2)):
    arr[i], arr[len(arr)-i-1] = arr[len(arr)-i-1], arr[i];
print(" ".join(arr));