# Совпадают ли строки?
# Необходимо определить, совпадают ли 2 строки.
#
# Входные данные
#
# Заданы 2 строки.
#
# Выходные данные
#
# Необходимо вывести  слово yes, если строки совпадают, и слово no в противном случае.
#
# Sample Input:
#
# a
# a
# Sample Output:
#
# yes

str1 = input();
str2 = input();
print('yes') if str1==str2 else print('no');